In [2]:
import pandas as pd
# Creating a DataFrame from a dictionary
data = {'Name': ['Alice', 'Bob', 'Charlie', 'David'],
        'Age': [25, 30, 35, 28],
        'City': ['New York', 'San Francisco', 'Los Angeles', 'Chicago']}
df = pd.DataFrame(data)
df

      Name  Age           City
0    Alice   25       New York
1      Bob   30  San Francisco
2  Charlie   35    Los Angeles
3    David   28        Chicago

In [3]:
df['Name']

0      Alice
1        Bob
2    Charlie
3      David
Name: Name, dtype: object

In [6]:
df.iloc[2]  # access data using position of row (index)

Name        Charlie
Age              35
City    Los Angeles
Name: 2, dtype: object

In [11]:
# access by position
df.iloc[2]['Name']  # access value of index number =2 and its name

'Charlie'

In [12]:
# access by label
df.loc[2]

Name        Charlie
Age              35
City    Los Angeles
Name: 2, dtype: object

In [13]:
df.loc[2]['Name']

'Charlie'

In [16]:
df[['Name', 'Age']]  # slicing

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   35
3    David   28

In [17]:
df['City']  # getting all city name

0         New York
1    San Francisco
2      Los Angeles
3          Chicago
Name: City, dtype: object

In [21]:
df[['City','Name']]   # slicing

            City     Name
0       New York    Alice
1  San Francisco      Bob
2    Los Angeles  Charlie
3        Chicago    David

In [22]:
df[1:3] #getting row 1 to before 3

      Name  Age           City
1      Bob   30  San Francisco
2  Charlie   35    Los Angeles

In [25]:
# finding unique datas
unique_Age_data = df['Age'].unique

unique_data

<bound method Series.unique of 0    25
1    30
2    35
3    28
Name: Age, dtype: int64>

In [33]:
high_above_30 = df['Age']>25
high_above_30

0    False
1     True
2     True
3     True
Name: Age, dtype: bool

In [28]:
# conditional filteringabs
high_above_25 = df[['Age']]>25
high_above_25

     Age
0  False
1   True
2   True
3   True

In [31]:
high_above_25 = df[df['Age']>25]
high_above_25

      Name  Age           City
1      Bob   30  San Francisco
2  Charlie   35    Los Angeles
3    David   28        Chicago